{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
{"text":"Create an unrivaled, innovative experience in the oft-homogenous e-commerce space. Rich with content, community elements, and brand experience. Future releases to include athlete pages, robust product comparison, outfit building capabilities, and brand history short pages.","timestamp":"2019-04-19T01:27:51Z","url":"http://thefreeagency.com/under-armour-web-site-v5.html"}
{"text":"A negative 13.4 percent return on investment is hardly something to crow about. But when your peers are faring much worse, you can breathe a little easier.\nAt the Mayo Clinic, the largest health care services provider on our list, revenue dropped 10.6 percent to $6.55 billion in 2008. The revenue drop follows jumps of 9.1 percent in 2007 and 9.7 in 2006. Mayo, which has a sizable endowment, also suffered negative returns. Harry Hoffman, Mayo’s treasurer and chief investment officer, said its long-term fund had about $2.7 billion at the beginning of 2008 and finished the year around $2.2 billion, a negative return of nearly 18 percent.","timestamp":"2019-04-23T22:40:47Z","url":"https://inthenews.mayoclinic.org/2009/12/21/clawing-their-way-back/"}
{"text":"This furnished 2bed/2bath with a bonus room is located on the main canal in Horseshoe Beach. The condo property offers fully fenced swimming pool over looking the Gulf of Mexico, passenger elevator, 1st come 1st serve boat dockage, fish cleaning and a boat wash station. Come and enjoy the hidden coast line, tootle around town in your golf cart and enjoy salt water fishing at its finest.","timestamp":"2019-04-24T22:02:10Z","url":"https://www.pristinepropertiesonline.com/homes/502-Main-Street/Horseshoe-Beach/FL/32648/82487235/"}
{"text":"By adding the Keep Calm And Kill Zombies Poster to your dorm supplies, you'll bring a very unique dorm item to your collection of college products. Not to mention, no one can call your wall decor for college bland if you include this poster. By adding fun dorm products like this, you'll keep your dorm decor funny and will certainly make that living space into a cool hangout place. So pair some posters for cheap with a dorm futon, comfy college chairs, and other hangout-type college supplies, and you'll be set to have one of the best rooms in your building. And in its very least, this college poster is also quite colorful, which will make that living space of yours that much better to live in.","timestamp":"2019-04-22T17:06:42Z","url":"https://www.dormco.com/Keep_Calm_And_Kill_Zombies_Poster_Cool_College_p/30725.htm"}
{"text":"KeywordSpy currently operates in USA, United Kingdom, Australia & Canada Through this keyword tool, you can perform advanced keyword research and keyword tracking to study what your competitors have been advertising in Adwords & Other PPC campaigns to improve your own PPC campaign. Finally with this keyword software, you can now get Adwords tips and a complete in-depth analysis, stats, budget, affiliates & ad copies of your competitors. We track over 30 million domains such as ebay.com, amazon.com, timber-frame-home.top-research.biz and others.","timestamp":"2019-04-21T08:35:26Z","url":"http://www.keywordspy.com/organic/domain.aspx?q=timber-frame-home.top-research.biz"}
{"text":"At The Law Offices of Daniel W. Mitnick & Associates, P.C., our attorneys have 25 years of combined experience, the respect of our peers, and a reputation for success on behalf of our clients. A knowledgeable Alpharetta lawyer with our firm can represent both plaintiffs and defendants in enforcement actions throughout the metro area. Attorney Mitnick is admitted to practice law in state court, the United States District Court Northern District of Georgia, United States Court of Appeals 11th Circuit, and the United States Supreme Court. Our attorneys are skilled litigators and fully prepared to handle your case.\nIf you are not receiving your court ordered child support, the first step is to obtain an enforcement order from the court. If your former spouse still refuses to pay, our experienced Alpharetta attorney can petition the court to allow collection through garnishment of wages. If that is not enough, we can help you take further action. Our firm also defends clients in child support enforcement actions. We present the strongest case possible, based on the facts and the law.\nWe represent plaintiffs and defendants in child custody and visitation actions. When a child custody enforcement order is issued by the court, it empowers the police to locate and return the child to the custodial parent. Contempt of such an order can result in jail time.\nIf you need assistance with enforcing a court order, call our firm as soon as possible. With more than 25 years of experience in a wide range of cases, our firm has the knowledge you need on your side. Contact us before it is too late!","timestamp":"2019-04-20T19:01:16Z","url":"https://mitnicklawfirm.com/family-law-divorce/contempt-orders/"}
{"text":"Quaint and Quiet Victorian Villages Awaits! Super location and condition! Single-story means no stairs and split living concept means everyone has privacy or you have an extra room for a front office! Second full Bathroom makes this family and guest-friendly. Very centrally located: close to all of the amenities that Lincoln Village has to offer and easy access to other hot spots in North Stockton. Walking distance and/or short drive to Lincoln Schools! Beautiful laminate floors and updated bathrooms. Cozy up on cold nights next to the fireplace in the spacious living area. Cool off in the Summer with the nearby pool.\nListing provided courtesy of Concierge Realtors Inc.. Listing information © 2019 MetroList Services, Inc.","timestamp":"2019-04-21T12:18:52Z","url":"https://www.findmyhomeroseville.com/homes/1581-W-Swain-Road/Stockton/CA/95207/91316633/"}
{"text":"For other uses, see Aten (disambiguation).\nAkhenaten and his family adoring the Aten. Second from the left is Meritaten, who was the daughter of Akhenaten.\nAten (also Aton, Ancient Egyptian: jtn) is the disk of the sun in ancient Egyptian mythology, and originally an aspect of the god Ra. The deified Aten is the focus of the monotheistic religion of Atenism established by Amenhotep IV, who later took the name Akhenaten (died ca. 1335 BCE) in worship and recognition of Aten. In his poem \"Great Hymn to the Aten\", Akhenaten praises Aten as the creator, giver of life, and nurturing spirit of the world. Aten does not have a Creation Myth or family but is mentioned in the Book of the Dead. The worship of Aten was eradicated by Horemheb.\nThe first known reference to Aten the sun-disk as a deity is in The Story of Sinuhe from the 12th dynasty, in which the deceased king is described as rising as a god to the heavens and uniting with the sun-disk, the divine body merging with its maker. By analogy, the term \"silver aten\" was sometimes used to refer to the moon. The solar Aten was extensively worshipped as a god in the reign of Amenhotep III when it was depicted as a falcon-headed man much like Ra. In the reign of Amenhotep III's successor, Amenhotep IV, the Aten became the central god of the Egyptian state religion, and Amenhotep IV changed his name to Akhenaten to reflect his close link with the new supreme deity.\nThe full title of Akhenaten's god was \"Ra-Horakhty who rejoices in the horizon, in his Name as the Light which is in the sun disc.\" (This is the title of the god as it appears on the numerous stelae placed to mark the boundaries of Akhenaten's new capital at Akhetaten, modern Amarna.) This lengthy name was often shortened to Ra-Horus-Aten or just Aten in many texts, but the god of Akhenaten raised to supremacy is considered a synthesis of very ancient gods viewed in a new and different way. The god is also considered to be both masculine and feminine simultaneously. All creation was thought to emanate from the god and to exist within the god. In particular, the god was not depicted in anthropomorphic (human) form, but as rays of light extending from the sun's disk.\nFurthermore, the god's name came to be written within a cartouche, along with the titles normally given to a Pharaoh, another break with ancient tradition. Ra-Horus, more usually referred to as Ra-Horakhty (Ra, who is Horus of the two horizons), is a synthesis of two other gods, both of which are attested from very early on. During the Amarna period, this synthesis was seen as the invisible source of energy of the sun god, of which the visible manifestation was the Aten, the solar disk. Thus Ra-Horus-Aten was a development of old ideas which came gradually. The real change, as some see it, was the apparent abandonment of all other gods, especially Amun-Ra, prohibition of idolatry, and the debatable introduction of quasi-monotheism by Akhenaten. The syncretism is readily apparent in the Great Hymn to the Aten in which Re-Herakhty, Shu and Aten are merged into the creator god. Others see Akhenaten as a practitioner of an Aten monolatry, as he did not actively deny the existence of other gods; he simply refrained from worshipping any but the Aten. Other scholars call the religion henotheistic.\nIn the Old Kingdom Egypt, the word \"Aten\" is a noun meaning \"disc\" which referred to anything flat and circular; though the sun was still called \"disc of the day\" where Ra was thought to reside. Only later, in Middle Kingdom Egypt, did it come to be the name of a god during Akhenaten's rule.\nAten's name is displayed in two cartouches, carrying royal implications in the framework around the name. Some have interpreted this to mean that Akhenaten was the embodiment of Aten, and the worship of Aten is directly worship of Akhenaten; but others have taken this as an indicator of Aten as the supreme ruler even over the current reigning royalty.\nPrinciples of Aten's religion were recorded on the rock tomb walls of Akhetaten. In the religion of Aten (Atenism), night is a time to fear. Work is done best when the sun, Aten, is present. Aten cares for every creature, and created a Nile river in the sky (rain) for the Syrians. Aten created all countries and people. The rays of the sun disk only holds out life to the royal family; everyone else receives life from Akhenaten and Nefertiti in exchange for loyalty to Aten.\nThere is only one known instance of the Aten talking, \"said by the 'Living Aten': my rays illuminate...\"\nWhen a good person dies, they continue to live in the City of Light for the dead in Akhetaten. The conditions are the same after death.\nThe explanation as to why Aten could not be fully represented was that Aten was beyond creation. Thus the scenes of gods carved in stone previously depicted animals and human forms, now showed Aten as an orb above with life-giving rays stretching toward the royal figure. The king was depicted singularly in relation to divine power. This power transcended human or animal form.\nAkhenaten represented himself not as a god, but as a son of Aten, shifting the previous methods of pharaohs claiming to be the embodiment of Horus. This contributes to the belief that Atenism should be considered a monotheistic religion where \"the living Aten beside whom there is no other; he was the sole god\".\nThe \"Great Hymn to Aten\" written as if Akhenaten is the one speaking but it is arguable on whether he wrote it himself or not.\nThe cult centre of Aten was at the new city Akhetaten; some other cult cities include Thebes and Heliopolis. The principles of Aten's cult were recorded on the rock walls of tombs of Tall al-Amarnah. Significantly different from other ancient Egyptian temples, temples of Aten were colorful and open-roofed to allow the rays of the sun. Doorways had broken lintels and raised thresholds. No statues of Aten were allowed; those were seen as idolatry. However, these were typically replaced by functionally equivalent representations of Akhenaten and his family venerating the Aten and receiving the ankh (breath of life) from him. Priests had less to do since offerings (fruits, flowers, cakes) were limited, and oracles were not needed. Temples of Aten did not collect tax.\nElite women were known to worship the Aten in sun-shade temples in Akhetaten.\nIn the worship of Aten, the daily service of purification, anointment, and clothing of the divine image was not performed. Incense was burnt several times a day. Hymns sung to Aten were accompanied by harp music. Aten's ceremonies in Akhetaten involved giving offerings to Aten with a swipe of the royal scepter.\nInstead of barque processions, the royal family rode on a chariot on festival days.\nAten is an evolution of the idea of a sun god in Egyptian mythology, deriving a lot of his concepts of power and representation from the earlier god Ra but building on top of the power Ra represents. Aten carried absolute power in the universe, representing the life-giving force of light to the world as well as merging with the concept and goddess Maat to develop further responsibilities for Aten beyond the power of light itself.\n\"Aten bends low, near the earth, to watch over his creation; he takes his place in the sky for the same purpose; he wearies himself in the service of the creatures; he shines for them all; he gives them sun and sends them rain. The unborn child and the baby chick are cared for; and Akhenaten asks his divine father to 'lift up' the creatures for his sake so that they might aspire to the condition of perfection of his father, Aten\".\nFourteen Steles were placed to mark the boundaries of the new city Akhetaten, modern day Amarna. Each stele was marked with a declaration of the founding of the city as well as a depiction of the royal family worshiping Aten. Akhenaten patrolled the city grounds on a chariot, overseeing the construction of the city and temples for the purpose of honoring their new sole god, Aten. Akhetaten was declared Egypt's new capital during the reign of Akhenaten. The city had a central road called the \"Royal Road\" by modern historians leading to the palace. By building the city all at once, the layout of the city was entirely open to Akhenaten's design with many large structures dedicated to the worship of Aten.\nAten's temples were unique in architecture compared to other Egyptian temples of the time. Balustrades depicting Akhenaten, the Queen and the Princess embracing the rays of Aten would flank either side of stairwells, ramps, or altars. Fragments of these Balustrades were initially identified as Stele but were later decided to be balustrades due to the location they were found and the way the pattern was carved into both faces of the slab.\nTemples to Aten were open-air structures with little to no roofing to maximize the amount of sunlight on the interior. A slaughter yard and places to grow food were near the temple for preparing sacrifices to Aten. Two temples were central to the city of Akhetaten, the larger of the two had an \"open, unroofed structure covering an area of about 800 by 300 metres (2,600 ft × 1,000 ft) at the northern end of the city\". Aten, by nature, was everywhere and intangible because he was the sunlight and energy in the world. Therefore, he did not have physical representations that other Egyptian gods had; he was represented by the sun disc and reaching rays of light.\nAkhenaten was considered the \"high priest\" or even a prophet of Aten, being the main propagator of the religion in Egypt during his reign. After the death of Akhenaten, his son, Tutankhamun, reinstated the cult of Amun and the ban on religions in competition with Atenism was lifted. The point of this transition can be seen in the name change of Tutankhaten into Tutankhamun indicating the loss of favor in the worship of Aten. With the death of Akhenaten, the city of Amarna was abandoned, along with the worship of Aten. There is evidence that the people under Akhetaten's rule did not directly worship Aten, but \"Worshiped the king and queen worshiping the disc\". The cult of Aten was still in Egypt for another ten years or so as it faded and there was no purge of the cult after Akhenaten's death. When Tutankhamun came into power, his religious reign was one of tolerance, the only difference was that Aten was no longer the only god. Tutankhamun rebuilt the temples that were destroyed during Akhenaten's reign and he reinstated the old pantheon of gods. This return to the gods that were before Aten was \"a move based publicly on the doctrine that Egypt's woes stemmed directly from its ignoring the gods, and in turn the gods' abandonment of Egypt\".\nDuring the Amarna Period, the Aten was given a Royal Titulary (as he was considered to be king of all), with his names drawn in a cartouche. There were two forms of the title. The first had the names of other gods, and the second later one was more 'singular' and referred only to the Aten himself. The early form has Re-Horakhti. who rejoices in the Horizon, in his name Shu, which is the Aten. The later form has Re, ruler of the two horizons, who rejoices in the Horizon, in his name of light, which is the Aten.\nHigh relief and low relief illustrations of the Aten show it with a curved surface, therefore, the late scholar Hugh Nibley insisted that a more correct translation would be globe, orb or sphere, rather than disk. The three-dimensional spherical shape of the Aten is even more evident when such reliefs are viewed in person, rather than merely in photographs.\nEgyptologists have vocalized the word variously as Aten, Aton, Atonu, and Itn.\nAkhenaten: \"Effective spirit of the Aten\".\nAkhetaten: \"Horizon of the Aten\", Akhenaten's capital. The archaeological site is known as Amarna.\nAnkhesenpaaten: \"Her life is of the Aten\".\nBeketaten: \"Handmaid of the Aten\".\nMeritaten: \"She who is beloved of the Aten\".\nMeketaten: \"Behold the Aten\" or \"Protected by Aten\".\nNeferneferuaten: \"The most beautiful one of Aten\".\nTutankhaten: \"Living image of the Aten\". Original name of Tutankhamun.\n^ Dominic Montserrat, Akhenaten: History, Fantasy and Ancient Egypt, Routledge 2000, ISBN 0-415-18549-1, pp. 36ff.\n^ Brewer, Douglas J.; Emily Teeter (22 February 2007). Egypt and the Egyptians (2 ed.). Cambridge University Press. p. 105. ISBN 978-0-521-85150-3.\n^ a b c d e Redford, Donald (1984). Akhenaten: The Heretic King. Princeton University Press. pp. 170–172. ISBN 978-0-691-03567-3.\n^ Bennett, John (1965). \"Notes on the 'Aten'\". The Journal of Egyptian Archaeology. 51: 207–209. doi:10.2307/3855637. JSTOR 3855637.\n^ Gunn, Battiscombe (1923). \"Notes on the Aten and His Names\". The Journal of Egyptian Archaeology. 9 (3/4): 168–176. doi:10.2307/3854036. JSTOR 3854036.\n^ Akhenaten and the City of Light. Cornell University Press. 2001. p. 8. ISBN 978-0801487255. Retrieved 15 February 2015.\n^ Perry, Glenn (2004). The History of Egypt. Greenwood Publishing Group. p. 1. ISBN 9780313322648. Retrieved 15 February 2015.\n^ Pinch, Geraldine (2002). Handbook of Egyptian Mythology. ABC-CLIO. p. 110. ISBN 9781576072424. Retrieved 15 February 2015.\n^ Goldwasser, Orly (2010). \"The Aten is the \"Energy of Light\": New Evidence from the Script\". Journal of the American Research Center in Egypt. 46: 163. JSTOR 41431576.\n^ Groenewegen-Frankfort, Henriette Antonia (1951). Arrest and Movement: An Essay on Space and Time in the Representational Art of the Ancient Near East. Cambridge, Massachusetts: Harvard University Press. p. 99. ISBN 978-0674046566.\n^ \"Aton\". Britannica. Retrieved 27 November 2017.\n^ \"Aten, god of Egypt\". Siteseen Ltd. June 2014. Retrieved 22 December 2014.\n^ \"History embalmed: Aten\". 2014 Siteseen Ltd. Retrieved 22 December 2014.\n^ Pasquali, Stéphane (2011). \"A sun-shade temple of Princess Ankhesenpaaten in Memphis?\". The Journal of Egyptian Archaeology. 97: 219. JSTOR 23269901.\n^ a b c d e f Freed, Rita E.; D'Auria, Sue; Markowitz, Yvonne J. (1999). Pharaohs of the sun : Akhenaten, Nefertiti, Tutankhamen. Boston: Museum of Fine Arts in association with Bulfinch Press/Little, Brown and Co. ISBN 978-0878464708. OCLC 42450325.\n^ Shaw, Ian (1994). \"Balustrades, Stairs and Altars in the Cult of the Aten at el-Amarna\". The Journal of Egyptian Archaeology. 80: 109–127. doi:10.2307/3821854. JSTOR 3821854.\n^ The ancient gods speak : a guide to Egyptian religion. Redford, Donald B. Oxford: Oxford University Press. 2002. ISBN 978-0195154016. OCLC 49698760.\n^ Erik., Hornung, (2001). Akhenaten and the religion of light. Ithaca, N.Y.: Cornell University Press. ISBN 978-0801487255. OCLC 48417401.\n^ See: Collier, Mark and Manley, Bill (1998). How to Read Egyptian Hieroglyphs: 2nd Edition. Berkeley: University of California Press. p. 29.\nAmarna is an extensive Egyptian archaeological site that represents the remains of the capital city newly established and built by the Pharaoh Akhenaten of the late Eighteenth Dynasty, and abandoned shortly after his death. The name for the city employed by the ancient Egyptians is written as Akhetaten in English transliteration. Akhetaten means \"Horizon of the Aten\".\nThe Great Hymn to the Aten is the longest of one of a number of hymn-poems written to the sun-disk deity Aten. Composed in the middle of the 14th century BC, it is attributed to the 18th dynasty Pharaoh Akhenaten, who radically changed traditional forms of Egyptian religion by replacing them with Atenism.\nTalatat are stone blocks of standardized size used during the 18th dynasty reign of the Pharaoh Akhenaten in the building of the Aton temples at Karnak and Akhetaten. The standardized size and their small weight made construction more efficient. Their use may have begun in the second year of Akhenaten's reign. After the Amarna Period talatat construction was abandoned, apparently not having withstood the test of time.\nThe Egyptian noble Panehesy was the 'Chief servitor of the Aten in the temple of Aten in Akhetaten'.\nAmarna art, or the Amarna style, is a style adopted in the Amarna Period during and just after the reign of Akhenaten in the late Eighteenth Dynasty, during the New Kingdom. Whereas Ancient Egyptian art was famously slow to alter, the Amarna style was a significant and sudden break from its predecessor, which was restored after Akhenaten's death. It is characterized by a sense of movement and activity in images, with figures having raised heads, many figures overlapping and many scenes busy and crowded. The human body is portrayed differently; figures, always shown in profile on reliefs, are slender, swaying, with exaggerated extremities. In particular, depictions of Akhenaten give him distinctly feminine qualities such as large hips, prominent breasts, and a larger stomach and thighs. Other pieces, such as the most famous of all Amarna works, the Nefertiti Bust in Berlin, show much less pronounced features of the style.\nThe Ancient Egyptian noble Parennefer was Akhenaten's close advisor before he came to the throne, and in later times served as his Royal Butler, an office which brought him into intimate contact with the king. His titles include \"The King's Cup Bearer,\" \"Washer of the King's Hands,\" \"Chief Craftsman,\" and \"Overseer of All the Works in the Mansion of Aten.\" He was instrumental in imposing the \"Amarna style\" in architecture.\nA God Against the Gods is a 1976 historical novel by political novelist Allen Drury, which chronicles ancient Egyptian Pharaoh Akhenaten's attempt to establish a new religion in Egypt. It is told in a series of monologues by the various characters.\nIpy, also transliterated as Apy, was a court official from the time of Amenhotep III and Akhenaten during the Egyptian 18th Dynasty. Ipy was High Steward of Memphis, and a royal scribe.","timestamp":"2019-04-18T15:26:33Z","url":"https://wikivividly.com/wiki/Aten"}
{"text":"Yes, you have the right to view the reference.\nSend us a request to view the reference, stating the e-mail address that was used to provide it, and we will send you the reference report. As the report contains the user's personal details, we will notify him/her of your request.","timestamp":"2019-04-26T02:45:46Z","url":"https://support.refq.com/hc/en-us/articles/208254825-Can-I-view-the-submitted-reference-"}
{"text":"Contaf is a 5% EC formulation of Hexaconazole, an excellent Triazole Fungicide, highly effective against sheath blight of paddy, leafspots and blights on all types of crops and powdery mildew of Crops like grapes, chillies etc. Hexaconazole technical has a Broad Spectrum Protectant Eradicant and Systemic Fungicidal Action. It belongs to a new class of Triazoles, Hexaconazole. The technical is available as a 92% w/w. Hexaconazole formulations are available in 5% EC, 10% EC & 5% SC. We also supply customized formulations as per customer's requirements.","timestamp":"2019-04-25T13:50:56Z","url":"https://www.bighaat.com/collections/crop-protection/products/contaf-fungicide"}
